ИСПП/src/AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач/ТоварыКОформлениюИзлишковНедостач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОформлениюИзлишковНедостач</name>
  <resources>
    <name>КОформлениюОприходования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/InformationRegisters/ЕдиницыИзмеренияНоменклатуры/ЕдиницыИзмеренияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЕдиницыИзмеренияНоменклатуры</name>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИСПП/src/AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеПоддержкаПроектов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	// Текущее состояние набора помещается во временную таблицу "ДвиженияПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый",    ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = ПроведениеПоддержкаПроектов.ПолучитьМенеджерВременныхТаблицДляКонтроляПроведения(ДополнительныеСвойства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ДокументОснование                       КАК ДокументОснование,
	|	Таблица.Организация                             КАК Организация,
	|	Таблица.Номенклатура                            КАК Номенклатура,
	|	Таблица.СерияНоменклатуры                       КАК СерияНоменклатуры,
	|	Таблица.Партия                                  КАК Партия,
	|	Таблица.Склад                                   КАК Склад,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.КОформлениюОприходования
	|		ИНАЧЕ
	|			-Таблица.КОформлениюОприходования
	|	КОНЕЦ                                           КАК КОформлениюОприходованияПередЗаписью,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			Таблица.КОформлениюСписания
	|		ИНАЧЕ
	|			-Таблица.КОформлениюСписания
	|	КОНЕЦ                                           КАК КОформлениюСписанияПередЗаписью
	|ПОМЕСТИТЬ ТоварыКОформлениюИзлишковНедостачПередЗаписью
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый
	|";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеПоддержкаПроектов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ПроведениеПоддержкаПроектов.ПолучитьМенеджерВременныхТаблицДляКонтроляПроведения(ДополнительныеСвойства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.ДокументОснование                     КАК ДокументОснование,
	|	Таблица.Организация                           КАК Организация,
	|	Таблица.Номенклатура                          КАК Номенклатура,
	|	Таблица.СерияНоменклатуры                     КАК СерияНоменклатуры,
	|	Таблица.Партия                                КАК Партия,
	|	Таблица.Склад                                 КАК Склад,
	|	Таблица.КОформлениюОприходованияПередЗаписью  КАК КОформлениюОприходованияИзменение,
	|	Таблица.КОформлениюСписанияПередЗаписью       КАК КОформлениюСписанияИзменение
	|ПОМЕСТИТЬ ТаблицаИзменений
	|ИЗ
	|	ТоварыКОформлениюИзлишковНедостачПередЗаписью КАК Таблица
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	Таблица.ДокументОснование               КАК ДокументОснование,
	|	Таблица.Организация                     КАК Организация,
	|	Таблица.Номенклатура                    КАК Номенклатура,
	|	Таблица.СерияНоменклатуры               КАК СерияНоменклатуры,
	|	Таблица.Партия                          КАК Партия,
	|	Таблица.Склад                           КАК Склад,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.КОформлениюОприходования
	|		ИНАЧЕ
	|			Таблица.КОформлениюОприходования
	|	КОНЕЦ                                   КАК КОформлениюОприходованияИзменение,
	|	ВЫБОР КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|			-Таблица.КОформлениюСписания
	|		ИНАЧЕ
	|			Таблица.КОформлениюСписания
	|	КОНЕЦ                                   КАК КОформлениюСписанияИзменение
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаИзменений.ДокументОснование                         КАК ДокументОснование,
	|	ТаблицаИзменений.Организация                               КАК Организация,
	|	ТаблицаИзменений.Номенклатура                              КАК Номенклатура,
	|	ТаблицаИзменений.СерияНоменклатуры                         КАК СерияНоменклатуры,
	|	ТаблицаИзменений.Партия                                    КАК Партия,
	|	ТаблицаИзменений.Склад                                     КАК Склад,
	|	СУММА(ТаблицаИзменений.КОформлениюОприходованияИзменение)  КАК КОформлениюОприходованияИзменение,
	|	СУММА(ТаблицаИзменений.КОформлениюСписанияИзменение)       КАК КОформлениюСписанияИзменение
	|ПОМЕСТИТЬ ДвиженияТоварыКОформлениюИзлишковНедостачИзменение
	|ИЗ
	|	ТаблицаИзменений КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.ДокументОснование,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.Номенклатура,
	|	ТаблицаИзменений.СерияНоменклатуры,
	|	ТаблицаИзменений.Партия,
	|	ТаблицаИзменений.Склад
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.КОформлениюОприходованияИзменение) > 0
	|	ИЛИ СУММА(ТаблицаИзменений.КОформлениюСписанияИзменение) > 0
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКОформлениюИзлишковНедостачПередЗаписью
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаИзменений
	|";
	
	Выборка = Запрос.ВыполнитьПакет()[1].Выбрать();
	Выборка.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияТоварыКОформлениюИзлишковНедостачИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	Если Выборка.Количество > 0 Тогда
		ПроведениеПоддержкаПроектов.ДобавитьПараметрыКонтроля(
			ДополнительныеСвойства,
			ТекстЗапросаПроверки(),
			РегистрыНакопления.ТоварыКОформлениюИзлишковНедостач);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПроверки()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаОстатков.ДокументОснование                                       КАК ДокументОснование,
	|	ТаблицаОстатков.Организация                                             КАК Организация,
	|	ТаблицаОстатков.Номенклатура                                            КАК Номенклатура,
	|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения                           КАК Упаковка,
	|	ТаблицаОстатков.СерияНоменклатуры                                       КАК СерияНоменклатуры,
	|	ТаблицаОстатков.Партия                                                  КАК Партия,
	|	ТаблицаОстатков.Склад                                                   КАК Склад,
	|	ТаблицаОстатков.КОформлениюОприходованияОстаток / Упаковки.Коэффициент  КАК КОформлениюОприходования,
	|	ТаблицаОстатков.КОформлениюСписанияОстаток / Упаковки.Коэффициент       КАК КОформлениюСписания
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Остатки(,
	|			(ДокументОснование, Организация, Номенклатура, СерияНоменклатуры, Партия, Склад) В
	|				(ВЫБРАТЬ
	|					Таблица.ДокументОснование,
	|					Таблица.Организация,
	|					Таблица.Номенклатура,
	|					Таблица.СерияНоменклатуры,
	|					Таблица.Партия,
	|					Таблица.Склад
	|				ИЗ
	|					ДвиженияТоварыКОформлениюИзлишковНедостачИзменение КАК Таблица)
	|	) КАК ТаблицаОстатков
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЕдиницыИзмеренияНоменклатуры КАК Упаковки
	|	ПО
	|		ТаблицаОстатков.Номенклатура = Упаковки.Номенклатура
	|		И ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения = Упаковки.ЕдиницаИзмерения
	|
	|ГДЕ
	|	ТаблицаОстатков.КОформлениюОприходованияОстаток < 0
	|	ИЛИ ТаблицаОстатков.КОформлениюСписанияОстаток < 0
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
